docs/articles/runtime/Registration.mmd
sequenceDiagram

    actor Game

    Game -> SubModule: OnBeforeInitialModuleScreenSetAsRoot()
    SubModule -> UIExtender: Register()

    UIExtender -> UIExtender: Find attributed types
    UIExtender -> UIExtender: Create runtime for module and store it
    UIExtender -> UIExtenderRuntime: Register()
    loop for each type
        alt prefab extension
            UIExtenderRuntime -> PrefabComponent: RegisterPatch()
            PrefabComponent --> UIExtenderRuntime: return
            PrefabComponent -> PrefabComponent: store extension for later
            PrefabComponent --> UIExtenderRuntime: return
            UIExtenderRuntime -> GauntletMoviePatch: Register(AutoGenName)
            GauntletMoviePatch --> UIExtenderRuntime: return
        else if view model extension
            UIExtenderRuntime -> ViewModelComponent: RegisterViewModelMixin()
            ViewModelComponent -> ViewModelComponent: store mixin for later
            ViewModelComponent --> UIExtenderRuntime: return
        end
    end
    UIExtenderRuntime -> UIExtenderRuntime: <b>Patching</b> (see separate diagram)
    %%note over UIExtenderRuntime
    %%    See `ViewModelPatching` and `PrefabPatching` diagrams.
    %%endnote
    UIExtenderRuntime --> UIExtender: return
    UIExtender --> SubModule: return
    SubModule --> Game: return
